# MinSkylightWidthImperial Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..MinSkylightWidthImperial Property
BuiltInFailures..::..MassFailures Class See Also
---
The minimum skylight width is 8 inches.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MinSkylightWidthImperial { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MinSkylightWidthImperial As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MinSkylightWidthImperial {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace